Repository: SloMR/PastePoint
Catalog: client/ios/PastePoint/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: ar, es, fr, ru, zh_hans

source: Accept
ar: قبول
es: Aceptar
fr: Accepter
ru: Принять
zh_hans: 接受

# APP_VERSION
source: Version %@
ar: الإصدار %@
es: Versión %@
ru: Версия %@
zh_hans: 版本 %@

source: Attach files
ar: إرفاق ملفات
es: Adjuntar archivos
fr: Joindre des fichiers
ru: Прикрепить файлы
zh_hans: 附加文件

# BLOCK_USER
source: Block
ar: حظر
es: Bloquear
fr: Bloquer
ru: Заблокировать
zh_hans: 屏蔽

# BLOCKED_USER_TOAST
source: Blocked %@. Their messages were removed.
ar: تم حظر %@. تمت إزالة رسائله.
es: Has bloqueado a %@. Se han eliminado sus mensajes.
fr: %@ a été bloqué. Ses messages ont été supprimés.
ru: Пользователь %@ заблокирован. Его сообщения удалены.
zh_hans: 已屏蔽 %@。其消息已被移除。

# CAMERA_ACCESS_MESSAGE
source: PastePoint needs camera access to scan QR codes. Enable it in Settings.
ar: يحتاج PastePoint إلى إذن الكاميرا لمسح رموز QR. فعّله من الإعدادات.
es: PastePoint necesita acceso a la cámara para escanear códigos QR. Actívalo en Ajustes.
fr: PastePoint a besoin d'accéder à la caméra pour scanner les codes QR. Activez-le dans Réglages.
ru: PastePoint нужен доступ к камере для сканирования QR-кодов. Включите его в Настройках.
zh_hans: PastePoint 需要相机权限来扫描二维码。请在「设置」中开启。

source: Camera Access Required
ar: إذن الكاميرا مطلوب
es: Se requiere acceso a la cámara
fr: Accès à la caméra requis
ru: Требуется доступ к камере
zh_hans: 需要相机权限

source: Cancel
ar: إلغاء
es: Cancelar
fr: Annuler
ru: Отмена
zh_hans: 取消

source: Cancelled
ar: تم الإلغاء
es: Cancelado
fr: Annulé
ru: Отменено
zh_hans: 已取消

# CANT_ACCEPT_FILE
source: Couldn't accept file
ar: تعذّر قبول الملف
es: No se pudo aceptar el archivo
fr: Impossible d'accepter le fichier
ru: Не удалось принять файл
zh_hans: 无法接受文件

# CANT_DECLINE_FILE
source: Couldn't decline file
ar: تعذّر رفض الملف
es: No se pudo rechazar el archivo
fr: Impossible de refuser le fichier
ru: Не удалось отклонить файл
zh_hans: 无法拒绝文件

source: Change language
ar: تغيير اللغة
es: Cambiar idioma
fr: Changer de langue
ru: Сменить язык
zh_hans: 切换语言

source: Choose Files
ar: اختيار ملفات
es: Elegir archivos
fr: Choisir des fichiers
ru: Выбрать файлы
zh_hans: 选择文件

source: Clear
ar: مسح
es: Borrar
fr: Effacer
ru: Очистить
zh_hans: 清除

source: Close
ar: إغلاق
es: Cerrar
fr: Fermer
ru: Закрыть
zh_hans: 关闭

source: Code
ar: الرمز
es: Código
ru: Код
zh_hans: 代码

# CODE_COPIED
source: Code copied to clipboard
ar: تم نسخ الرمز إلى الحافظة
es: Código copiado al portapapeles
fr: Code copié dans le presse-papiers
ru: Код скопирован в буфер обмена
zh_hans: 代码已复制到剪贴板

# CONNECT_A_DEVICE
source: Create an invite link
ar: إنشاء رابط دعوة
es: Crear un enlace de invitación
fr: Créer un lien d’invitation
ru: Создать ссылку-приглашение
zh_hans: 创建邀请链接

# CONNECT_DEVICE_TITLE
source: Connect a device
ar: ربط جهاز
es: Conectar un dispositivo
fr: Connecter un appareil
ru: Подключить устройство
zh_hans: 连接设备

source: Connected
ar: تم الاتصال
es: Conectado
fr: Connecté
ru: Подключено
zh_hans: 已连接

source: Connecting…
ar: جارٍ الاتصال…
es: Conectando…
fr: Connexion…
ru: Подключение…
zh_hans: 连接中…

# CONNECTING_DESC
source: Some members aren't reachable yet.
ar: تعذّر الوصول إلى بعض الأعضاء حتى الآن.
es: Aún no se puede contactar con algunos miembros.
fr: Certains membres ne sont pas encore joignables.
ru: Некоторые участники пока недоступны.
zh_hans: 部分成员暂时无法连接。

# CONNECTING_TITLE
source: Still connecting…
ar: لا يزال الاتصال جارياً…
es: Aún conectando…
fr: Connexion en cours…
ru: Подключение продолжается…
zh_hans: 仍在连接…

# CONNECTING_TO_PEERS
source: Connecting to peers… try again in a moment
ar: جارٍ الاتصال بالأقران… أعد المحاولة بعد قليل
es: Conectando con los pares… inténtalo de nuevo en un momento
fr: Connexion aux pairs… réessayez dans un instant
ru: Подключение к участникам… попробуйте ещё раз через мгновение
zh_hans: 正在连接成员…请稍后重试

source: Connection lost
ar: تم فقد الاتصال
es: Conexión perdida
fr: Connexion perdue
ru: Соединение потеряно
zh_hans: 连接已断开

source: Copy
ar: نسخ
es: Copiar
fr: Copier
ru: Копировать
zh_hans: 复制

# COPYRIGHT_NOTICE
source: © 2026 PastePoint. All rights reserved.
ar: © 2026 PastePoint. جميع الحقوق محفوظة.
es: © 2026 PastePoint. Todos los derechos reservados.
fr: © 2026 PastePoint. Tous droits réservés.
ru: © 2026 PastePoint. Все права защищены.
zh_hans: © 2026 PastePoint。保留所有权利。

# CREATE_A_NEW_ROOM
source: Create a Room
ar: أنشئ غرفة جديدة
es: Crear una sala
fr: Créer un salon
ru: Создать комнату
zh_hans: 新建聊天室

source: Create New Room
ar: إنشاء غرفة جديدة
es: Crear una nueva sala
fr: Créer un nouveau salon
ru: Создать новую комнату
zh_hans: 创建新聊天室

source: Decline
ar: رفض
es: Rechazar
fr: Refuser
ru: Отклонить
zh_hans: 拒绝

source: Declined
ar: مرفوض
es: Rechazado
fr: Refusé
ru: Отклонено
zh_hans: 已拒绝

source: Done
ar: تم
es: Listo
fr: Terminé
ru: Готово
zh_hans: 完成

# EMPTY_STATE_ALONE
source: Nobody here yet
ar: لا يوجد أحد هنا بعد
es: Aún no hay nadie
fr: Personne ici pour l’instant
ru: Здесь пока никого нет
zh_hans: 还没有其他人

# EMPTY_STATE_CONNECTED
source: You’re connected
ar: تم الاتصال
es: Estás conectado
fr: Vous êtes connecté
ru: Вы подключены
zh_hans: 已连接

# EMPTY_STATE_CONNECTED_BODY
source: Send a message or drop a file to get started.
ar: أرسل رسالة أو أفلت ملفًا للبدء.
es: Envía un mensaje o suelta un archivo para empezar.
fr: Envoyez un message ou déposez un fichier pour commencer.
ru: Отправьте сообщение или перетащите файл, чтобы начать.
zh_hans: 发送消息或拖入文件即可开始。

# EMPTY_STATE_TITLE
source: Share files and text, device to device
ar: شارك الملفات والنصوص بين أجهزتك
es: Comparte archivos y texto entre tus dispositivos
fr: Partagez fichiers et texte entre vos appareils
ru: Делитесь файлами и текстом между устройствами
zh_hans: 在你的设备之间共享文件和文本

# END_SESSION
source: Leave
ar: مغادرة
es: Salir
fr: Quitter
ru: Выйти
zh_hans: 离开

# END_SESSION_HEADER
source: Leave? You’ll go back to the devices on your Wi-Fi.
ar: مغادرة؟ ستعود إلى الأجهزة الموجودة على شبكتك.
es: ¿Salir? Volverás a los dispositivos de tu Wi-Fi.
fr: Quitter ? Vous reviendrez aux appareils de votre Wi-Fi.
ru: Выйти? Вы вернётесь к устройствам в вашей сети Wi-Fi.
zh_hans: 离开？你将回到同一 Wi-Fi 下的设备。

# END_THE_SESSION
source: Leave
ar: مغادرة
es: Salir
fr: Quitter
ru: Выйти
zh_hans: 离开

# ENTER_ROOM_NAME
source: Enter the Room Name
ar: أدخل اسم الغرفة
es: Nombre de la sala
fr: Nom du salon
ru: Название комнаты
zh_hans: 聊天室名称

# ENTER_SESSION_CODE
source: Code from the other device
ar: الرمز الظاهر على الجهاز الآخر
es: Código del otro dispositivo
fr: Code affiché sur l’autre appareil
ru: Код с другого устройства
zh_hans: 另一台设备上的代码

# FEATURE_ANY_FILE
source: Any file type & size
ar: أي نوع وحجم ملف
es: Cualquier tipo y tamaño de archivo
fr: Tout type et toute taille de fichier
ru: Любой тип и размер файла
zh_hans: 支持任意类型和大小的文件

# FEATURE_ENCRYPTED
source: End-to-end encrypted
ar: تشفير من طرف إلى طرف
es: Cifrado de extremo a extremo
fr: Chiffré de bout en bout
ru: Сквозное шифрование
zh_hans: 端到端加密

# FEATURE_FREE
source: Free & open source
ar: مجاني ومفتوح المصدر
es: Gratis y de código abierto
fr: Gratuit et open source
ru: Бесплатно и с открытым кодом
zh_hans: 免费且开源

# FEATURE_LOCAL_SPEED
source: Local network speed
ar: سرعة الشبكة المحلية
es: Velocidad de red local
fr: Vitesse du réseau local
ru: Скорость локальной сети
zh_hans: 本地网络速度

# FEATURE_NO_ACCOUNT
source: No account needed
ar: بدون إنشاء حساب
es: Sin necesidad de cuenta
fr: Aucun compte requis
ru: Без регистрации
zh_hans: 无需注册账号

# FEATURE_NO_CLOUD
source: No cloud storage
ar: بدون تخزين سحابي
es: Sin almacenamiento en la nube
fr: Aucun stockage cloud
ru: Без облачного хранилища
zh_hans: 不使用云存储

# FILE_ASSEMBLY_FAILED
source: Couldn’t assemble the received file
ar: تعذّر تجميع الملف المُستلَم
es: No se pudo ensamblar el archivo recibido
fr: Impossible d'assembler le fichier reçu
ru: Не удалось собрать полученный файл
zh_hans: 无法组装收到的文件

# FILE_CORRUPTED
source: File transfer failed — data was corrupted
ar: فشل نقل الملف — البيانات تالفة
es: Falló la transferencia — los datos estaban corruptos
fr: Échec du transfert — données corrompues
ru: Ошибка передачи — данные повреждены
zh_hans: 传输失败——数据已损坏

# FILE_EMPTY_ERROR
source: %@ is empty — nothing to send
ar: %@ فارغ — لا يوجد ما يُرسَل
es: %@ está vacío — no hay nada que enviar
fr: %@ est vide — rien à envoyer
ru: %@ пуст — нечего отправлять
zh_hans: %@ 为空——没有可发送的内容

# FILE_REJECTED_NO_HASH
source: File rejected — sender sent no integrity hash
ar: تم رفض الملف — لم يُرسِل المُرسِل بصمة تحقق للسلامة
es: Archivo rechazado — el remitente no envió una suma de verificación
fr: Fichier rejeté — l'expéditeur n'a fourni aucune empreinte d'intégrité
ru: Файл отклонён — отправитель не передал контрольную сумму целостности
zh_hans: 文件已被拒绝——发送方未提供完整性校验值

# FILE_SAVE_FAILED
source: Couldn’t save the received file
ar: تعذّر حفظ الملف المُستلَم
es: No se pudo guardar el archivo recibido
fr: Impossible d'enregistrer le fichier reçu
ru: Не удалось сохранить полученный файл
zh_hans: 无法保存收到的文件

# FILE_SEND_DELIVERED
source: Sent
ar: تم الإرسال
es: Enviado
fr: Envoyé
ru: Отправлено
zh_hans: 已发送

# FILE_SEND_HASH_FAILED
source: Couldn’t verify file before sending — cancelled
ar: تعذّر التحقق من الملف قبل الإرسال — تم الإلغاء
es: No se pudo verificar el archivo antes de enviar — cancelado
fr: Impossible de vérifier le fichier avant l'envoi — annulé
ru: Не удалось проверить файл перед отправкой — отменено
zh_hans: 发送前无法校验文件——已取消

# FILE_SEND_NONE
source: Not delivered
ar: لم يتم التسليم
es: No entregado
fr: Non remis
ru: Не доставлено
zh_hans: 未送达

# FILE_SEND_PARTIAL
source: Sent to %lld of %lld
ar: تم الإرسال إلى %lld من %lld
es: Enviado a %lld de %lld
fr: Envoyé à %lld sur %lld
ru: Отправлено %lld из %lld
zh_hans: 已发送给 %2$lld 人中的 %1$lld 人

# FILE_SEND_SENDING
source: Sending…
ar: جارٍ الإرسال…
es: Enviando…
fr: Envoi…
ru: Отправка…
zh_hans: 发送中…

# FILE_STATUS_COMPLETED
source: Completed
ar: اكتمل
es: Completado
fr: Terminé
ru: Завершено
zh_hans: 已完成

# FILE_STATUS_FAILED
source: Failed
ar: فشل
es: Fallido
fr: Échec
ru: Ошибка
zh_hans: 失败

# FILE_STATUS_PENDING
source: Pending...
ar: قيد الانتظار...
es: Pendiente...
fr: En attente...
ru: Ожидание...
zh_hans: 等待中…

# FILE_STATUS_RECEIVING
source: Receiving...
ar: جارٍ الاستلام...
es: Recibiendo...
fr: Réception...
ru: Получение...
zh_hans: 接收中…

# FILE_TRANSFER_STALLED
source: Transfer stalled — connection lost data
ar: توقّف النقل — فقد الاتصال البيانات
es: Transferencia detenida — la conexión perdió datos
fr: Transfert interrompu — la connexion a perdu des données
ru: Передача прервана — соединение потеряло данные
zh_hans: 传输已停滞——连接丢失数据

# FINALIZING_TRANSFER
source: Finalizing...
ar: جارٍ الإنهاء...
es: Finalizando...
fr: Finalisation...
ru: Завершение...
zh_hans: 正在完成……

source: Have a code?
ar: لديك رمز؟
es: ¿Tienes un código?
fr: Vous avez un code ?
ru: Есть код?
zh_hans: 有代码？

# INVALID_QR_CODE
source: Invalid PastePoint QR code
ar: رمز PastePoint غير صالح
es: Código QR de PastePoint no válido
fr: Code QR PastePoint invalide
ru: Недействительный QR-код PastePoint
zh_hans: 无效的 PastePoint 二维码

# INVALID_SESSION_CODE
source: Invalid code
ar: رمز غير صالح
es: Código no válido
fr: Code invalide
ru: Неверный код
zh_hans: 代码无效

# INVITE_SHARE_BODY
source: Scan this QR code with your other device, or send it the link.
ar: امسح رمز QR بجهازك الآخر، أو أرسل له الرابط.
es: Escanea este código QR con tu otro dispositivo o envíale el enlace.
fr: Scannez ce QR code avec votre autre appareil, ou envoyez-lui le lien.
ru: Отсканируйте этот QR-код другим устройством или отправьте ему ссылку.
zh_hans: 用你的另一台设备扫描此二维码，或将链接发送给它。

source: Invite the other device
ar: ادعُ الجهاز الآخر
es: Invita al otro dispositivo
fr: Inviter l’autre appareil
ru: Пригласить другое устройство
zh_hans: 邀请另一台设备

source: Join
ar: انضمام
es: Unirse
fr: Rejoindre
ru: Войти
zh_hans: 加入

source: Joining…
ar: جارٍ الانضمام…
es: Uniéndose…
fr: Connexion…
ru: Вход…
zh_hans: 加入中…

source: Leaving…
ar: جارٍ المغادرة…
es: Saliendo…
fr: Déconnexion…
ru: Выход…
zh_hans: 退出中…

# LEFT_PRIVATE_SESSION
source: You’re back on your Wi-Fi.
ar: عدت إلى شبكتك.
es: Has vuelto a tu Wi-Fi.
fr: Vous êtes de retour sur votre Wi-Fi.
ru: Вы вернулись в свою сеть Wi-Fi.
zh_hans: 你已回到自己的 Wi-Fi。

# LEGAL_GATE_ACCEPT
source: Agree & Continue
ar: أوافق ومتابعة
es: Aceptar y continuar
fr: Accepter et continuer
ru: Принять и продолжить
zh_hans: 同意并继续

# LEGAL_GATE_AGREEMENT
source: By continuing, you agree to our Terms of Service and Privacy Policy.
ar: بالمتابعة، فإنك توافق على شروط الخدمة وسياسة الخصوصية.
es: Al continuar, aceptas nuestros Términos del servicio y nuestra Política de privacidad.
fr: En continuant, vous acceptez nos Conditions d'utilisation et notre Politique de confidentialité.
ru: Продолжая, вы соглашаетесь с нашими Условиями обслуживания и Политикой конфиденциальности.
zh_hans: 继续即表示您同意我们的服务条款和隐私政策。

# LEGAL_GATE_MESSAGE
source: PastePoint connects your devices directly to share messages and files.
ar: يربط PastePoint أجهزتك مباشرةً لمشاركة الرسائل والملفات.
es: PastePoint conecta tus dispositivos directamente para compartir mensajes y archivos.
fr: PastePoint connecte vos appareils directement pour partager des messages et des fichiers.
ru: PastePoint напрямую соединяет ваши устройства для обмена сообщениями и файлами.
zh_hans: PastePoint 直接连接您的设备，用于共享消息和文件。

# LEGAL_GATE_TITLE
source: Welcome to PastePoint
ar: مرحبًا بك في PastePoint
es: Te damos la bienvenida a PastePoint
fr: Bienvenue sur PastePoint
ru: Добро пожаловать в PastePoint
zh_hans: 欢迎使用 PastePoint

# LEGAL_GATE_ZERO_TOLERANCE
source: There is zero tolerance for objectionable content or abusive users. You can block anyone in a chat.
ar: لا نتسامح إطلاقًا مع المحتوى المرفوض أو المستخدمين المسيئين. يمكنك حظر أي شخص في المحادثة.
es: No se tolera el contenido objetable ni los usuarios abusivos. Puedes bloquear a cualquier persona en un chat.
fr: Aucune tolérance envers les contenus répréhensibles ou les utilisateurs abusifs. Vous pouvez bloquer toute personne dans une discussion.
ru: Нулевая терпимость к неприемлемому контенту и злоупотребляющим пользователям. Вы можете заблокировать любого участника чата.
zh_hans: 我们对令人反感的内容和滥用行为的用户采取零容忍政策。您可以屏蔽聊天中的任何人。

# LOCAL_NETWORK_OFF_DESC
source: PastePoint needs it to find people nearby.
ar: يحتاجه PastePoint للعثور على الأشخاص القريبين.
es: PastePoint lo necesita para encontrar personas cercanas.
fr: PastePoint en a besoin pour trouver les personnes à proximité.
ru: Это нужно PastePoint, чтобы находить людей поблизости.
zh_hans: PastePoint 需要它来发现附近的人。

# LOCAL_NETWORK_OFF_JOIN
source: Local network is off — enable it in Settings to join
ar: الشبكة المحلية معطّلة — فعّلها من الإعدادات للانضمام
es: La red local está desactivada — actívala en Ajustes para unirte
fr: Le réseau local est désactivé — activez-le dans Réglages pour rejoindre
ru: Локальная сеть отключена — включите её в Настройках, чтобы войти
zh_hans: 本地网络已关闭——请在「设置」中开启以加入

# LOCAL_NETWORK_OFF_START
source: Local network is off — enable it in Settings
ar: الشبكة المحلية معطّلة — فعّلها من الإعدادات
es: La red local está desactivada — actívala en Ajustes
fr: Le réseau local est désactivé — activez-le dans Réglages
ru: Локальная сеть отключена — включите её в Настройках
zh_hans: 本地网络已关闭——请在「设置」中开启

# LOCAL_NETWORK_OFF_TITLE
source: Local network access is off
ar: إذن الشبكة المحلية معطّل
es: El acceso a la red local está desactivado
fr: L'accès au réseau local est désactivé
ru: Доступ к локальной сети отключён
zh_hans: 本地网络访问已关闭

source: Members
ar: الأعضاء
es: Miembros
fr: Membres
ru: Участники
zh_hans: 成员

# NO_MEMBERS_ONLINE
source: No one is online right now
ar: لا يوجد أعضاء متصلون
es: Nadie está conectado en este momento
fr: Personne n'est en ligne pour le moment
ru: Сейчас никого нет в сети
zh_hans: 目前没有人在线

source: No peers connected
ar: لا يوجد مستخدمون متصلون
es: Sin usuarios conectados
fr: Aucun utilisateur connecté
ru: Нет подключённых пользователей
zh_hans: 没有已连接的用户

# ONLINE_MEMBERS_COUNT
source: %lld Online Now
ar: %lld متصل الآن
es: %lld conectados ahora
fr: %lld en ligne
ru: %lld участника в сети
zh_hans: %lld 人在线

source: Open Settings
ar: فتح الإعدادات
es: Abrir Ajustes
fr: Ouvrir Réglages
ru: Открыть Настройки
zh_hans: 打开设置

# OPTION_ELSEWHERE_BODY
source: Phone on mobile data, or someone somewhere else? Create a link they can open from anywhere.
ar: هاتف على بيانات الجوال، أو شخص في مكان آخر؟ أنشئ رابطًا يمكن فتحه من أي مكان.
es: ¿Un teléfono con datos móviles o alguien en otro lugar? Crea un enlace que puedan abrir desde cualquier sitio.
fr: Un téléphone en données mobiles, ou quelqu’un ailleurs ? Créez un lien qu’il pourra ouvrir de n’importe où.
ru: Телефон на мобильном интернете или кто-то в другом месте? Создайте ссылку, которую можно открыть откуда угодно.
zh_hans: 手机使用移动数据，或对方在别处？创建一个可在任何地方打开的链接。

# OPTION_ELSEWHERE_BODY_CONNECTED
source: Create a link someone on another network can open. You’ll move to a new private room — devices on this Wi-Fi won’t follow.
ar: أنشئ رابطًا يمكن لشخص على شبكة أخرى فتحه. ستنتقل إلى غرفة خاصة جديدة — لن تتبعك الأجهزة الموجودة على هذه الشبكة.
es: Crea un enlace que alguien en otra red pueda abrir. Pasarás a una sala privada nueva: los dispositivos de esta Wi-Fi no te seguirán.
fr: Créez un lien qu’une personne sur un autre réseau pourra ouvrir. Vous passerez dans un nouveau salon privé — les appareils de ce Wi-Fi ne suivront pas.
ru: Создайте ссылку, которую откроет кто-то из другой сети. Вы перейдёте в новую приватную комнату — устройства в этой сети Wi-Fi за вами не последуют.
zh_hans: 创建一个其他网络的人可以打开的链接。你将进入一个新的私密房间——此 Wi-Fi 下的设备不会跟随。

# OPTION_ELSEWHERE_TITLE
source: On a different network?
ar: على شبكة أخرى؟
es: ¿En otra red?
fr: Sur un autre réseau ?
ru: В другой сети?
zh_hans: 在其他网络？

# OPTION_SAME_WIFI_BODY
source: Just open PastePoint on the other device — it joins automatically.
ar: افتح PastePoint على الجهاز الآخر فقط — سينضم تلقائيًا.
es: Solo abre PastePoint en el otro dispositivo: se conectará automáticamente.
fr: Ouvrez simplement PastePoint sur l’autre appareil — il se connectera tout seul.
ru: Просто откройте PastePoint на другом устройстве — оно подключится само.
zh_hans: 只需在另一台设备上打开 PastePoint，它会自动加入。

# OPTION_SAME_WIFI_TITLE
source: On this Wi-Fi?
ar: على نفس الشبكة؟
es: ¿En esta Wi-Fi?
fr: Sur ce Wi-Fi ?
ru: В этой же сети Wi-Fi?
zh_hans: 在同一 Wi-Fi？

source: Photo Library
ar: مكتبة الصور
es: Fototeca
fr: Photothèque
ru: Медиатека
zh_hans: 照片图库

# PHOTOS_PERMISSION_DENIED
source: Allow Photos access in Settings to save received media
ar: اسمح بالوصول إلى الصور من الإعدادات لحفظ الوسائط المُستلَمة
es: Permite el acceso a Fotos en Ajustes para guardar los archivos recibidos
fr: Autorisez l'accès aux Photos dans Réglages pour enregistrer les médias reçus
ru: Разрешите доступ к Фото в Настройках, чтобы сохранять полученные медиафайлы
zh_hans: 请在「设置」中允许访问「照片」以保存收到的媒体

# POINT_CAMERA_AT_QR
source: Point your camera at a PastePoint QR code
ar: وجّه الكاميرا نحو رمز PastePoint
es: Apunta la cámara a un código QR de PastePoint
fr: Pointez votre caméra vers un code QR PastePoint
ru: Наведите камеру на QR-код PastePoint
zh_hans: 请将摄像头对准 PastePoint 的二维码

# PRIVACY_AND_TERMS
source: Privacy & Terms
ar: الخصوصية والشروط
es: Privacidad y términos
fr: Confidentialité et conditions
ru: Конфиденциальность и условия
zh_hans: 隐私与条款

# PRIVATE_SESSION_JOINED
source: Connected. Only people with the link can join.
ar: تم الاتصال. لا ينضم إلا من لديه الرابط.
es: Conectado. Solo pueden unirse quienes tengan el enlace.
fr: Connecté. Seules les personnes ayant le lien peuvent rejoindre.
ru: Подключено. Присоединиться могут только те, у кого есть ссылка.
zh_hans: 已连接。只有拥有链接的人才能加入。

# PRIVATE_SESSION_STARTED
source: Ready. Share the code to connect a device.
ar: جاهز. شارك الرمز لربط جهاز.
es: Listo. Comparte el código para conectar un dispositivo.
fr: Prêt. Partagez le code pour connecter un appareil.
ru: Готово. Поделитесь кодом, чтобы подключить устройство.
zh_hans: 已就绪。分享代码以连接设备。

# QR_SCANNING_NOT_SUPPORTED
source: QR scanning is not supported on this device.
ar: مسح رموز QR غير مدعوم على هذا الجهاز.
es: Este dispositivo no admite el escaneo de códigos QR.
fr: Le scan de codes QR n'est pas pris en charge sur cet appareil.
ru: Сканирование QR-кодов не поддерживается на этом устройстве.
zh_hans: 此设备不支持二维码扫描。

source: Reconnected
ar: تمت إعادة الاتصال
es: Reconectado
fr: Reconnecté
ru: Переподключено
zh_hans: 已重新连接

source: Report and Block
ar: إبلاغ وحظر
es: Denunciar y bloquear
fr: Signaler et bloquer
ru: Пожаловаться и заблокировать
zh_hans: 举报并屏蔽

# REPORT_EMAIL_INTRO
source: Please describe what happened (optional):
ar: يرجى وصف ما حدث (اختياري):
es: Describe lo que ha ocurrido (opcional):
fr: Décrivez ce qui s'est passé (facultatif) :
ru: Опишите, что произошло (необязательно):
zh_hans: 请描述发生了什么（可选）：

# REPORT_EMAIL_SUBJECT
source: PastePoint report: objectionable content
ar: بلاغ PastePoint: محتوى مرفوض
es: Denuncia de PastePoint: contenido objetable
fr: Signalement PastePoint : contenu répréhensible
ru: Жалоба PastePoint: неприемлемый контент
zh_hans: PastePoint 举报：令人反感的内容

# REPORT_MAIL_UNAVAILABLE
source: No email account is set up, so the report could not be sent. The user has been blocked.
ar: لا يوجد حساب بريد إلكتروني مُعد، لذا تعذّر إرسال البلاغ. تم حظر المستخدم.
es: No hay ninguna cuenta de correo configurada, así que no se pudo enviar la denuncia. El usuario ha sido bloqueado.
fr: Aucun compte e-mail n'est configuré, le signalement n'a pas pu être envoyé. L'utilisateur a été bloqué.
ru: Учётная запись почты не настроена, поэтому жалобу отправить не удалось. Пользователь заблокирован.
zh_hans: 未设置电子邮件账户，无法发送举报。该用户已被屏蔽。

# ROOM_CREATED
source: Room created successfully!
ar: تم إنشاء الغرفة بنجاح!
es: ¡Sala creada con éxito!
fr: Salon créé avec succès !
ru: Комната успешно создана!
zh_hans: 聊天室创建成功!

# ROOM_JOINED
source: Joined %@
ar: تم الانضمام إلى %@
es: Te has unido a %@
fr: Vous avez rejoint %@
ru: Вы вошли в %@
zh_hans: 已加入 %@

# ROOM_NAME_DESCRIPTION
source: Enter a name for the room you want to join or create.
ar: أدخل اسم الغرفة التي تريد الانضمام إليها أو إنشاؤها.
es: Introduce el nombre de la sala a la que quieres unirte o crear.
fr: Saisissez le nom du salon que vous souhaitez rejoindre ou créer.
ru: Введите название комнаты, к которой хотите присоединиться или которую хотите создать.
zh_hans: 输入您要加入或创建的聊天室名称。

# ROOM_NAME_PLACEHOLDER
source: Room name
ar: اسم الغرفة
es: Escribe un nombre de sala
fr: Saisissez un nom de salon
ru: Введите название комнаты
zh_hans: 输入聊天室名称

# ROOMS
source: Chat Rooms
ar: الغرف
es: Salas de chat
fr: Salons de discussion
ru: Комнаты чата
zh_hans: 聊天室

# ROOMS_COUNT
source: %lld Rooms
ar: %lld غرفة
es: %lld salas
fr: %lld salons
ru: %lld комнаты
zh_hans: %lld 个聊天室

source: Saved to Files
ar: تم الحفظ في الملفات
es: Guardado en Archivos
fr: Enregistré dans Fichiers
ru: Сохранено в Файлы
zh_hans: 已保存到「文件」

source: Saved to Photos
ar: تم الحفظ في الصور
es: Guardado en Fotos
fr: Enregistré dans Photos
ru: Сохранено в Фото
zh_hans: 已保存到「照片」

source: Scan QR Code
ar: مسح رمز QR
es: Escanear código QR
fr: Scanner le code QR
ru: Сканировать QR-код
zh_hans: 扫描二维码

source: Scanner Unavailable
ar: الماسح غير متاح
es: Escáner no disponible
fr: Scanner indisponible
ru: Сканер недоступен
zh_hans: 扫描器不可用

source: Send
ar: إرسال
es: Enviar
fr: Envoyer
ru: Отправить
zh_hans: 发送

source: Send file to user
ar: إرسال ملف للمستخدم
es: Enviar archivo al usuario
fr: Envoyer un fichier à l'utilisateur
ru: Отправить файл пользователю
zh_hans: 发送文件给用户

# SERVER_RECONNECT_COUNTDOWN
source: Reconnecting in %llds · attempt %lld
ar: إعادة الاتصال خلال %lld ث · المحاولة %lld
es: Reconectando en %lld s · intento %lld
fr: Reconnexion dans %lld s · tentative %lld
ru: Переподключение через %lld с · попытка %lld
zh_hans: %lld 秒后重新连接 · 第 %lld 次尝试
